In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
from datetime import datetime

In [5]:
myyear = 2015

In [6]:
mymonth = 1

In [7]:
myday = 1

In [8]:
myhour = 1

In [9]:
myminute = 10

In [10]:
mysecond = 14

In [13]:
mydate = datetime(myyear,mymonth,myday,myhour,myminute,mysecond)

In [14]:
mydate

datetime.datetime(2015, 1, 1, 1, 10, 14)

In [15]:
mydate.year

2015

In [16]:
mydate.astimezone

In [17]:
mydate.ctime

In [33]:
my = pd.Series(['3 Jun,1990','2000-01-01',None])

In [34]:
my

0    3 Jun,1990
1    2000-01-01
2          None
dtype: object

In [36]:
t = pd.to_datetime(my)

In [37]:
type(t)

pandas.core.series.Series

In [38]:
t

0   1990-06-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [40]:
t[0].year

1990

In [53]:
ob = '1-12-2002'

In [54]:
pd.to_datetime(ob,dayfirst=True)

Timestamp('2002-12-01 00:00:00')

In [55]:
style = '12--Dec--2000'

In [60]:
pd.to_datetime(style,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [67]:
c = '12th dec  2000'

In [68]:
pd.to_datetime(c)

Timestamp('2000-12-12 00:00:00')

In [89]:
sales = pd.read_csv('RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [79]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [71]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [80]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [81]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [82]:
sales = sales.set_index('DATE')

In [83]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [87]:
sales.resample(rule = 'A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [96]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int64